In [44]:
import pandas as pd
import numpy as np

In [57]:
df = pd.read_csv("./data/large_countries_2015.csv", sep=",", index_col=0)

In [48]:
df.index.name = 'country'

In [49]:
df.reset_index(inplace=True)

In [58]:
df

                 population  fertility      continent
Bangladesh     1.609956e+08       2.12           Asia
Brazil         2.078475e+08       1.78  South America
China          1.376049e+09       1.57           Asia
India          1.311051e+09       2.43           Asia
Indonesia      2.575638e+08       2.28           Asia
Japan          1.265735e+08       1.45           Asia
Mexico         1.270172e+08       2.13  North America
Nigeria        1.822020e+08       5.89         Africa
Pakistan       1.889249e+08       3.04           Asia
Philippines    1.006994e+08       2.98           Asia
Russia         1.434569e+08       1.61         Europe
United States  3.217736e+08       1.97  North America

In [51]:
df["population"].mean()

375346161.6666667

In [52]:
df["fertility"].mean()

2.4374999999999996

In [39]:
df["continent"].value_counts()

Asia             7
North America    2
South America    1
Africa           1
Europe           1
Name: continent, dtype: int64

### 1.11.1 Examples

In [59]:
df['population'] = df['population'] / 1000000
df['population'] = round(df['population'], 1)

In [60]:
df

               population  fertility      continent
Bangladesh          161.0       2.12           Asia
Brazil              207.8       1.78  South America
China              1376.0       1.57           Asia
India              1311.1       2.43           Asia
Indonesia           257.6       2.28           Asia
Japan               126.6       1.45           Asia
Mexico              127.0       2.13  North America
Nigeria             182.2       5.89         Africa
Pakistan            188.9       3.04           Asia
Philippines         100.7       2.98           Asia
Russia              143.5       1.61         Europe
United States       321.8       1.97  North America

In [61]:
# Calculate the average population size of the large countries
average_population = df['population'].mean()

In [62]:
average_population

375.34999999999997

In [54]:
# Calculate the average population size by continent
avg_pop_per_continent = round(df.groupby('continent')['population'].mean(), 2)

In [63]:
avg_pop_per_continent

continent
Africa           182.20
Asia             503.13
Europe           143.50
North America    224.40
South America    207.80
Name: population, dtype: float64

### 1.11.2 Split

In [64]:
# 1. by column
g1 = df.groupby('continent')
g1.groups

{'Africa': ['Nigeria'], 'Asia': ['Bangladesh', 'China', 'India', 'Indonesia', 'Japan', 'Pakistan', 'Philippines'], 'Europe': ['Russia'], 'North America': ['Mexico', 'United States'], 'South America': ['Brazil']}

In [65]:
# 2. by an array of equal length
industrialized = np.array([False, True, True, True, False, True, True, False, False, False, True, True])
g2 = df.groupby(industrialized)
g2.groups

{False: ['Bangladesh', 'Indonesia', 'Nigeria', 'Pakistan', 'Philippines'], True: ['Brazil', 'China', 'India', 'Japan', 'Mexico', 'Russia', 'United States']}

In [66]:
# 3. by a Dictionary with keys on the Index
language = {'Bangladesh':'BN', 'Brazil':'PT', 'China':'CN',
            'India':'BN', 'Indonesia':'MS', 'Japan':'JP',
            'Mexico':'ES', 'Nigeria':'NG', 'Pakistan':'UR',
            'Philippines':'PP', 'Russia':'RU', 'United States':'EN'}
g3 = df.groupby(language)
g3.groups

{'BN': ['Bangladesh', 'India'], 'CN': ['China'], 'EN': ['United States'], 'ES': ['Mexico'], 'JP': ['Japan'], 'MS': ['Indonesia'], 'NG': ['Nigeria'], 'PP': ['Philippines'], 'PT': ['Brazil'], 'RU': ['Russia'], 'UR': ['Pakistan']}

In [67]:
# 4. by a function
g4 = df.groupby(len)
g4.groups

{5: ['China', 'India', 'Japan'], 6: ['Brazil', 'Mexico', 'Russia'], 7: ['Nigeria'], 8: ['Pakistan'], 9: ['Indonesia'], 10: ['Bangladesh'], 11: ['Philippines'], 13: ['United States']}

In [68]:
# 5. a list of the above
g5 = df.groupby(['continent', language, len])
g5.groups

{('Africa', 'NG', 7): ['Nigeria'], ('Asia', 'BN', 5): ['India'], ('Asia', 'BN', 10): ['Bangladesh'], ('Asia', 'CN', 5): ['China'], ('Asia', 'JP', 5): ['Japan'], ('Asia', 'MS', 9): ['Indonesia'], ('Asia', 'PP', 11): ['Philippines'], ('Asia', 'UR', 8): ['Pakistan'], ('Europe', 'RU', 6): ['Russia'], ('North America', 'EN', 13): ['United States'], ('North America', 'ES', 6): ['Mexico'], ('South America', 'PT', 6): ['Brazil']}

In [69]:
# 6. group along the x-axis
g6 = df[['population', 'fertility']].transpose().groupby(len, axis=1)
g6.groups

{5: ['China', 'India', 'Japan'], 6: ['Brazil', 'Mexico', 'Russia'], 7: ['Nigeria'], 8: ['Pakistan'], 9: ['Indonesia'], 10: ['Bangladesh'], 11: ['Philippines'], 13: ['United States']}

In [73]:
for i, df_group in df.groupby('continent'):
    print(i, df_group, '\n')

Africa          population  fertility continent
Nigeria       182.2       5.89    Africa

Asia              population  fertility continent
Bangladesh        161.0       2.12      Asia
China            1376.0       1.57      Asia
India            1311.1       2.43      Asia
Indonesia         257.6       2.28      Asia
Japan             126.6       1.45      Asia
Pakistan          188.9       3.04      Asia
Philippines       100.7       2.98      Asia

Europe         population  fertility continent
Russia       143.5       1.61    Europe

North America                population  fertility      continent
Mexico              127.0       2.13  North America
United States       321.8       1.97  North America

South America         population  fertility      continent
Brazil       207.8       1.78  South America

### 1.11.3 Apply

In [74]:
g = df.groupby('continent')

In [75]:
# standard aggregation functions
g.mean()
g.max()
g.min()
g.sum()
g.count()
g.std()
g.median()
g.quantile(0.9)
g.describe()

# Aggregation with selecting columns
g['population'].describe()

,count,mean,std,min,25%,50%,75%,max
continent,,,,,,,,
Africa,1.0,182.200000,NaN,182.2,182.2,182.2,182.20,182.2
Asia,7.0,503.128571,576.558860,100.7,143.8,188.9,784.35,1376.0
Europe,1.0,143.500000,NaN,143.5,143.5,143.5,143.50,143.5
North America,2.0,224.400000,137.744401,127.0,175.7,224.4,273.10,321.8
South America,1.0,207.800000,NaN,207.8,207.8,207.8,207.80,207.8

In [76]:
# Aggregation with a list of function names
g.agg(['count', 'mean', 'std'])

              population                         fertility
                   count        mean         std     count      mean       std
continent
Africa                 1  182.200000         NaN         1  5.890000       NaN
Asia                   7  503.128571  576.558860         7  2.267143  0.620154
Europe                 1  143.500000         NaN         1  1.610000       NaN
North America          2  224.400000  137.744401         2  2.050000  0.113137
South America          1  207.800000         NaN         1  1.780000       NaN

In [83]:
g.agg([('Total', 'sum')])        # includes label

              population fertility
                   Total     Total
continent
Africa             182.2      5.89
Asia              3521.9     15.87
Europe             143.5      1.61
North America      448.8      4.10
South America      207.8      1.78

In [84]:
# custom aggregation function with parameter
def sum_greater(dataframe, threshold):
    for column in dataframe.columns:
        return dataframe[dataframe[column]>threshold].sum()
    
g.agg(sum_greater, threshold=200)

               population  fertility
continent
Africa                0.0       0.00
Asia               2944.7       6.28
Europe                0.0       0.00
North America       321.8       1.97
South America       207.8       1.78

In [85]:
# Transformation by function name
g.transform('mean')

               population  fertility
Bangladesh     503.128571   2.267143
Brazil         207.800000   1.780000
China          503.128571   2.267143
India          503.128571   2.267143
Indonesia      503.128571   2.267143
Japan          503.128571   2.267143
Mexico         224.400000   2.050000
Nigeria        182.200000   5.890000
Pakistan       503.128571   2.267143
Philippines    503.128571   2.267143
Russia         143.500000   1.610000
United States  224.400000   2.050000

In [86]:
# Transformation by function reference
g.transform(len)

               population  fertility
Bangladesh              7          7
Brazil                  1          1
China                   7          7
India                   7          7
Indonesia               7          7
Japan                   7          7
Mexico                  2          2
Nigeria                 1          1
Pakistan                7          7
Philippines             7          7
Russia                  1          1
United States           2          2

In [87]:
# Transformation with your own function
def normalize(array):
    return array - array.mean()

g.transform(normalize)

               population  fertility
Bangladesh    -342.128571  -0.147143
Brazil           0.000000   0.000000
China          872.871429  -0.697143
India          807.971429   0.162857
Indonesia     -245.528571   0.012857
Japan         -376.528571  -0.817143
Mexico         -97.400000   0.080000
Nigeria          0.000000   0.000000
Pakistan      -314.228571   0.772857
Philippines   -402.428571   0.712857
Russia           0.000000   0.000000
United States   97.400000  -0.080000

In [88]:
# apply any function
def first_two(df):
    return df.head(2)

g.apply(first_two)

                             population  fertility      continent
continent
Africa        Nigeria             182.2       5.89         Africa
Asia          Bangladesh          161.0       2.12           Asia
              China              1376.0       1.57           Asia
Europe        Russia              143.5       1.61         Europe
North America Mexico              127.0       2.13  North America
              United States       321.8       1.97  North America
South America Brazil              207.8       1.78  South America

## Recap: Solve with One-Liners

In [131]:
# Read the file ../data/penguins_simple.csv
df = pd.read_csv("./data/penguins_simple.csv", sep=";")
df

,Species,Culmen Length (mm),Culmen Depth (mm),Flipper Length (mm),Body Mass (g),Sex
0,Adelie,39.1,18.7,181.0,3750.0,MALE
1,Adelie,39.5,17.4,186.0,3800.0,FEMALE
2,Adelie,40.3,18.0,195.0,3250.0,FEMALE
3,Adelie,36.7,19.3,193.0,3450.0,FEMALE
4,Adelie,39.3,20.6,190.0,3650.0,MALE
...,...,...,...,...,...,...
328,Gentoo,47.2,13.7,214.0,4925.0,FEMALE
329,Gentoo,46.8,14.3,215.0,4850.0,FEMALE
330,Gentoo,50.4,15.7,222.0,5750.0,MALE
331,Gentoo,45.2,14.8,212.0,5200.0,FEMALE
332,Gentoo,49.9,16.1,213.0,5400.0,MALE

In [132]:
def clean_column_names(cols):
    return cols.str.replace('(', '').str.replace(')', '').str.replace(' ', '_').str.lower()

df.columns = clean_column_names(df.columns)

/var/folders/mb/xqr44lqn1nv2_cy87gj4m2100000gn/T/ipykernel_55693/845750964.py:2: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  return cols.str.replace('(', '').str.replace(')', '').str.replace(' ', '_').str.lower()

In [133]:
# Who is the 7th penguin?
df[6:7]

,species,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
6,Adelie,39.2,19.6,195.0,4675.0,MALE

In [134]:
# How many Gentoos are in the dataset?
df[df["species"] == "Gentoo"].shape

(119, 6)

In [135]:
# Who is the heaviest penguin
df.sort_values("body_mass_g", ascending=False)[0:1]

,species,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
231,Gentoo,49.2,15.2,221.0,6300.0,MALE

In [137]:
# What is the mean size of female penguins?
df[df["sex"] == "FEMALE"]["body_mass_g"].mean()

3862.2727272727275

In [155]:
# How many penguins are heavier than 3kg?
# df[df["body_mass_g" > 3000]].len(df.index)
df[df["body_mass_g"] > 3000].shape

(323, 6)

In [158]:
# Select 3 random penguins.
df.sample(3)

,species,culmen_length_mm,culmen_depth_mm,flipper_length_mm,body_mass_g,sex
63,Adelie,41.8,19.4,198.0,4450.0,MALE
186,Chinstrap,49.0,19.5,210.0,3950.0,MALE
214,Gentoo,46.1,13.2,211.0,4500.0,FEMALE